{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "name": "conv2d_1", "dtype": "float32", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "batch_input_shape": [null, 28, 28, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "name": "conv2d_2", "kernel_size": [3, 3], "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "padding": "valid", "data_format": "channels_last", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "units": 128, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "units": 10, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}